# Skip Gatekeeper quarantine for all cask installs
cask_args no_quarantine: true

# Shell & Navigation
brew "zsh"                              # Modern shell
brew "starship"                         # Modern prompt
brew "fzf"                              # Fuzzy finder
brew "zoxide"                           # Smart cd replacement
brew "broot"                            # Tree navigation and fuzzy finder
brew "atuin"                            # Shell history sync

# File Operations & Search
brew "ripgrep"                          # Fast recursive search (rg)
brew "fd"                               # Simple find alternative
brew "bat"                              # Cat with syntax highlighting
brew "eza"                              # Modern ls replacement
brew "sd"                               # Better sed alternative

# Git & Version Control
brew "git"                              # Version control

# System Utilities
brew "fileicon"                         # Set custom app icons from CLI
brew "wget"                             # File downloader
brew "rsync"                            # File sync
brew "mas"                              # Mac App Store CLI
brew "displayplacer"                    # Monitor arrangement automation
brew "dockutil"                         # Dock customization tool
brew "coreutils"                        # GNU core utilities

# Security & Secrets
brew "age"                              # Modern encryption
brew "sops"                             # Secrets management
brew "gnupg"                            # GPG encryption
brew "pinentry-mac"                     # macOS pinentry for GPG
tap "jorgelbg/tap"
brew "jorgelbg/tap/pinentry-touchid"    # Touch ID for GPG passphrase

# Task Runner
brew "just"                             # Command runner for justfile

# Development Tools
brew "neovim"                           # Terminal editor
brew "helix"                            # Modern modal editor

# Terminal Multiplexer
brew "zellij"                           # Modern tmux alternative

# System Monitoring
brew "btop"                             # Resource monitor
brew "procs"                            # Modern ps alternative
cask "istat-menus"                      # Menu bar system monitor

# Development Tools & Editors
cask "ghostty"                          # Fast native terminal
cask "wezterm"                          # GPU-accelerated terminal
cask "hammerspoon"                      # macOS automation

# Productivity & Window Management
cask "bettertouchtool"                  # Advanced input customization
cask "rectangle-pro"                    # Window management
cask "jordanbaird-ice"                  # Menu bar manager
cask "obsidian"                         # Knowledge management

# Browsers
cask "google-chrome"                    # Google Chrome
cask "vivaldi"                          # Privacy-focused browser

# Fonts (Nerd Fonts)
cask "font-sauce-code-pro-nerd-font"   # Primary terminal font