# Taps
tap "sijanc147/formulas"

# Git & Version Control
brew "gh"                               # GitHub CLI
brew "git-delta"                        # Syntax-highlighting diff viewer
brew "lazygit"                          # TUI for git operations
brew "bfg"                              # Git repo cleaner
# brew "tig"                            # Text-mode git interface (evaluate)
# brew "git-extras"                     # Git utilities collection (evaluate)
# brew "gitui"                          # Blazing fast git TUI (evaluate)
# brew "gh-dash"                        # GitHub dashboard (evaluate)
# brew "grit"                           # Multi-repo management (evaluate)

# Data Processing
brew "jq"                               # JSON processor
brew "yq"                               # YAML/TOML/JSON processor
# brew "fx"                             # Interactive JSON viewer (evaluate)
# brew "jless"                          # JSON viewer (evaluate)
# brew "dyff"                           # YAML diff tool (evaluate)
# brew "yamllint"                       # YAML linter (evaluate)

# System Utilities
brew "watch"                            # Command monitoring
brew "watchman"                         # File watcher (Meta)
# brew "dust"                           # Modern du alternative (evaluate)
# brew "duf"                            # Modern df alternative (evaluate)

# Network Tools
# brew "mtr"                            # Better traceroute/ping (evaluate)
# brew "dog"                            # Modern dig alternative (evaluate)
# brew "bandwhich"                      # Network bandwidth monitor (evaluate)

# HTTP/API Tools
# brew "xh"                             # Modern HTTP client (evaluate)
# brew "curlie"                         # Curl with httpie UI (evaluate)
# brew "httpie"                         # Human-friendly HTTP client (evaluate)
# brew "hurl"                           # HTTP request runner (evaluate)
# brew "oha"                            # HTTP load testing (evaluate)

# Security & Secrets
# brew "gitleaks"                       # Scan for secrets in repos (evaluate)
# brew "trufflehog"                     # Find secrets in git history (evaluate)

# Development Tools
brew "mise"                             # Version manager
brew "direnv"                           # Auto-load environment variables
brew "shellcheck"                       # Shell script linter
brew "docker"                           # Container CLI
brew "lima"                             # Linux VMs for macOS
brew "hyperfine"                        # Command benchmarking
# brew "tokei"                          # Code statistics (evaluate)

# Database Tools
# brew "usql"                           # Universal SQL CLI (evaluate)
# brew "pgcli"                          # Postgres CLI with autocomplete (evaluate)
# brew "litecli"                        # SQLite CLI with autocomplete (evaluate)
# brew "mycli"                          # MySQL CLI with autocomplete (evaluate)

# Docker/Container Tools
cask "docker"                           # Docker Desktop
brew "ctop"                             # Container monitoring
# brew "dive"                           # Docker image layer explorer (evaluate)
# brew "hadolint"                       # Dockerfile linter (evaluate)

# Terminal Enhancements & UI
# brew "glow"                           # Markdown renderer (evaluate)
# brew "moar"                           # Better pager (evaluate)
# brew "mcfly"                          # Neural shell history (evaluate)
# brew "gum"                            # Shell script UI toolkit (evaluate)
# brew "vhs"                            # Terminal screen recorder (evaluate)
# brew "charm"                          # Charm tools suite (evaluate)

# Task Management
# brew "taskwarrior-tui"                # Task management TUI (evaluate)

# AI/LLM Tools
brew "gemini-cli"                       # Google Gemini CLI
cask "codex"                            # OpenAI Codex CLI
cask "claude"                           # Anthropic Claude
cask "chatgpt"                          # OpenAI ChatGPT
# brew "mods"                           # Pipe-friendly AI (evaluate)
# brew "fabric"                         # AI workflow patterns (evaluate)

# macOS Settings
# brew "sijanc147/formulas/macprefs"   # System preferences management (evaluate)

# Development Tools & Editors
cask "cursor"                           # AI-powered code editor (Anysphere)
cask "cursor-cli"                       # Cursor CLI tools
cask "windsurf"                         # AI code editor (Codeium)
cask "antigravity"                      # AI code editor (Google)
cask "visual-studio-code"               # VS Code
cask "jetbrains-toolbox"                # JetBrains IDE manager

# File Managers
# brew "lf"                             # Terminal file manager (evaluate)
# brew "ranger"                         # Python-based file manager (evaluate)
# brew "nnn"                            # Fast file manager (evaluate)

# Additional Search Tools
# brew "ag"                             # The Silver Searcher (evaluate)

# Clipboard Management
# cask "clipy"                          # Clipboard history manager (evaluate)

# Fonts (Nerd Fonts) - Additional dev fonts
cask "font-droid-sans-mono-nerd-font"  # Monospace font
cask "font-fira-code-nerd-font"        # Monospace with ligatures
cask "font-fira-mono-nerd-font"        # Monospace variant
cask "font-hack-nerd-font"             # Monospace font
cask "font-jetbrains-mono-nerd-font"   # JetBrains monospace
cask "font-meslo-lg-nerd-font"         # Meslo variant
cask "font-roboto-mono-nerd-font"      # Google monospace
cask "font-space-mono-nerd-font"       # Google monospace
cask "font-ubuntu-mono-nerd-font"      # Ubuntu monospace

